package students.deniss_jankovskis.lesson_2.level_7.task_31;

class Comment {

    public static void main(String[] args) {

        String txt = "Напишите программу и";
        String txt2 = "и продемонстрируйте в ней использование"; // You are reading this code
        String txt3 = "однострочного и многострочного коментариев."; // I hope I did everything correct


        System.out.println(txt + txt2);
        System.out.println(txt3);

    }

}
